src/cf/Catalogs/fmBudgetingScenarios.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmBudgetingScenarios</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>PlanningPeriod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmPlanningPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PlanningPeriodicity</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmPlanningPeriodicity</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScenarioType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetingScenarioTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetingCurrencyRates</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/fmBudgetingScenarioTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmBudgetingScenarioTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Plan</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fact</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/fmBudgetingScenarios/Forms/ItemForm/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Object.Predefined Then
		Items.ScenarioType.ReadOnly = True;
	EndIf;
	Items.BudgetingCurrencyRates.Visible = Object.ScenarioType=Enums.fmBudgetingScenarioTypes.Plan;
EndProcedure

&AtClient
Procedure ScenarioTypesOnChange(Item)
	ScenarioTypesOnChangeServer();
EndProcedure

&AtServer
Procedure ScenarioTypesOnChangeServer()
	Object.BudgetingCurrencyRates = False;
	Items.BudgetingCurrencyRates.Visible = Object.ScenarioType=Enums.fmBudgetingScenarioTypes.Plan;
EndProcedure

#EndRegion
